#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//数组指针


//int arr[5];  arr是一个整型数组 数组5个元素，每个元素是整型
//int* parr1[10];  parr1是一个数组 数组有10个元素 每个元素的类型是int*  parr1是指针数组
//int(*parr2)[10];  parr2是一个指针 指向了一个数组 数组10个元素 每个元素的类型是int parr2是数组指针
//int(*parr3[10])[5];  parr3是一个数组 该数组有十个元素 每个元素是一个数组指针 该数组指针指向的数组有5个元素 每个元素是int
                    //有十个数组 每个数组都是int[5] 还有另外十个元素 每个是int(*)[5]这10个元素是parr3数组的  这每个元素指向一个int[5]数组

//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int i = 0;
//	int* p = arr;
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ", p[i]);
//		//printf("%d ", *(p + i));//*(p + i)取下标为i的元素的地址
//		printf("%d ", *(arr + i));//这两种写法一样
//		printf("%d ", arr[i]);//这样也行 arr[i]==*(arr+i)==*(p+i)==p[i]
//	}
//	return 0;
//}

//void print1(int arr[3][5], int x, int y)//这里是打印数组内容   参数是数组形式
//{
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < x; i++)
//	{
//		for (j = 0; j < y; j++)
//		{
//			printf("%d ", arr[i][j]);//这里打印的是一行
//		}
//		printf("\n");
//	}
//}
//void print2(int(*p)[5], int x, int y)//参数是指针形式
//{
//	int i = 0;
//	for (i = 0; i < x; i++)
//	{
//		int j = 0;
//		for (j = 0; j < y; j++)
//		{
//			printf("%d ", p[i][j]);//通过数组实现  因为设计成一维数组的地址，第一行的首元素[j]就是第几个下标
//			//printf("%d ", *(p[i] + j));
//			//printf("%d ", *(*(p + i) + j));
//			//printf("%d ", (*(p + i))[j]);//*(p + i)是找到第几行 [j]是下标为j的元素
//		}
//		printf("\n");
//	}
//}
//int main()//数组指针 一般用在二维数组以上
//{
//	int arr[3][5] = { {1,2,3,4,5},{2,3,4,5,6},{3,4,5,6,7} };
//	//arr-数组名-数组名就是首元素地址  所以这里的数组名就是首元素地址  
//	//把arr想象成一维数组，将每行想象成一个元素   所以有三个元素  而第一个元素就是第一行的地址，每一行是5个整型数组，写成print2
//	print1(arr,3,5);//将行和列传过去
//	print2(arr, 3, 5);
//	return 0;
//}

//int main()//数组指针的应用   但一般不这么用
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };//还能这样写
//	int* p = arr;
//	int i = 0;
//	for (i=0;i<10;i++)
//	{
//		printf("%d ", *(p + i));
//	}
//	return 0;
//}


//int main()// 数组指针的应用    但一般不这么用
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int(*pa)[10] = &arr;//把整体数组的地址给了pa
//	int i = 0;
//	for (i = 0; i < 10; i++)//还能这样写
//    {
//	    printf("%d ", *(*pa+i));//*pa就是arr  就是首元素地址 +i就是向后跳一个元素，昨天就是这样    然后解引用，得到元素
//     }
//
	//for (i = 0; i < 10; i++)//还有另外一种写法
	//{
	//	printf("%d ", (*pa)[i]);//*pa对pa解引用 拿到的是整个数组
	//}
//	return 0;
//}

//&数组名  取出的是元素地址  数组名+1和取数组名+1是有区别的

//int main()
//{
//	char* arr[5];
//	char *(*pa)[5]=&arr;//指针指向的数组是五个元素  每个元素类型是char*    pa是指针变量的名字，前面的*说明pa是指针  [5]说明pa指向是数组是5个元素
//	//char*是pa指向的数组的元素类型 
//	int arr2[10] = { 0 };
//	int (*pa2)[10]=&arr2;//数组的地址取出来，交给指针
//	return 0;
//}

//int main()//数组指针 是指针
//{
//	//int* p = NULL;//p整型指针-指向整型的指针-可以存放整型的地址
//	//char* pc = NULL;//pc是字符指针-指向字符的指针-可以存放字符的地址
//	//int arr[10] = { 0 };//数组指针-指向数组的指针-可以存放数组的地址
//	//arr-首元素地址
//	//arr[0]-首元素的地址
//	//&arr-数组的地址
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int(* p)[10]=&arr;//数组地址要存起来   括号括起来 就是指针  指向的是数组，10个元素，每个元素是int  p就是数组指针
//
//	return 0;
//}